cask_args appdir: '/Applications'

tap 'homebrew/bundle'

brew 'git'
brew 'git-lfs'
brew 'curl'
brew 'tmux'
brew 'coreutils'
brew 'imagemagick'
brew 'libgit2'
brew 'openssl'
brew 'readline'
brew 'xz'
brew 'wget'
brew 'yt-dlp'
brew 'ruby'  # ruby for jekyll
brew 'rbenv'  # ruby environment for jekyll
brew 'chruby'
brew 'ruby-install'
brew 'the_silver_searcher'
brew 'tcl-tk'
brew 'bitwarden-cli'  # password manager bitwarden
brew 'ffmpeg'
# brew 'open-mpi'
brew 'uv'
# brew 'pyenv'
# brew 'pyenv-virtualenv'

cask 'alfred'  # better spotlight
cask 'rectangle'  # window management with keyboard
cask 'dropbox'
cask 'pdf-expert'
cask 'zoom'
cask 'aldente'  # cap the max battery charge to 80%
cask 'alt-tab'  # alt + tab in windows OS
# cask 'mark-text'  # free markdown editor
cask 'bitwarden'  # password manager
cask 'mactex'  # LaTex
cask 'docker'
cask 'miniconda'
cask 'balance-lock'  # keep the volumes of left and right earphones
cask 'iina'  # movie player
cask 'notion'  # note app
cask 'keka'  # compress/extract Korean file names
cask 'iterm2'
cask 'slack'
cask 'webex'
cask 'shottr'
# cask 'visual-studio-code'
cask 'cursor'
cask 'handbrake-app'
cask 'readdle-spark'
cask 'chatgpt'
cask 'jordanbaird-ice'
